{
    "[PAD]": 0,
    "[UNK]": 1,
    "sep": 2,
    "a1": 3,
    "a2": 4,
    "a3": 5,
    "a4": 6,
    "a5": 7,
    "ai1": 8,
    "ai2": 9,
    "ai3": 10,
    "ai4": 11,
    "ai5": 12,
    "an1": 13,
    "an2": 14,
    "an3": 15,
    "an4": 16,
    "an5": 17,
    "ang1": 18,
    "ang2": 19,
    "ang3": 20,
    "ang4": 21,
    "ang5": 22,
    "ao1": 23,
    "ao2": 24,
    "ao3": 25,
    "ao4": 26,
    "ao5": 27,
    "ba1": 28,
    "ba2": 29,
    "ba3": 30,
    "ba4": 31,
    "ba5": 32,
    "bai1": 33,
    "bai2": 34,
    "bai3": 35,
    "bai4": 36,
    "bai5": 37,
    "ban1": 38,
    "ban2": 39,
    "ban3": 40,
    "ban4": 41,
    "ban5": 42,
    "bang1": 43,
    "bang2": 44,
    "bang3": 45,
    "bang4": 46,
    "bang5": 47,
    "bao1": 48,
    "bao2": 49,
    "bao3": 50,
    "bao4": 51,
    "bao5": 52,
    "bei1": 53,
    "bei2": 54,
    "bei3": 55,
    "bei4": 56,
    "bei5": 57,
    "ben1": 58,
    "ben2": 59,
    "ben3": 60,
    "ben4": 61,
    "ben5": 62,
    "beng1": 63,
    "beng2": 64,
    "beng3": 65,
    "beng4": 66,
    "beng5": 67,
    "bi1": 68,
    "bi2": 69,
    "bi3": 70,
    "bi4": 71,
    "bi5": 72,
    "bian1": 73,
    "bian2": 74,
    "bian3": 75,
    "bian4": 76,
    "bian5": 77,
    "biao1": 78,
    "biao2": 79,
    "biao3": 80,
    "biao4": 81,
    "biao5": 82,
    "bie1": 83,
    "bie2": 84,
    "bie3": 85,
    "bie4": 86,
    "bie5": 87,
    "bin1": 88,
    "bin2": 89,
    "bin3": 90,
    "bin4": 91,
    "bin5": 92,
    "bing1": 93,
    "bing2": 94,
    "bing3": 95,
    "bing4": 96,
    "bing5": 97,
    "bo1": 98,
    "bo2": 99,
    "bo3": 100,
    "bo4": 101,
    "bo5": 102,
    "bu1": 103,
    "bu2": 104,
    "bu3": 105,
    "bu4": 106,
    "bu5": 107,
    "ca1": 108,
    "ca2": 109,
    "ca3": 110,
    "ca4": 111,
    "ca5": 112,
    "cai1": 113,
    "cai2": 114,
    "cai3": 115,
    "cai4": 116,
    "cai5": 117,
    "can1": 118,
    "can2": 119,
    "can3": 120,
    "can4": 121,
    "can5": 122,
    "cang1": 123,
    "cang2": 124,
    "cang3": 125,
    "cang4": 126,
    "cang5": 127,
    "cao1": 128,
    "cao2": 129,
    "cao3": 130,
    "cao4": 131,
    "cao5": 132,
    "ce1": 133,
    "ce2": 134,
    "ce3": 135,
    "ce4": 136,
    "ce5": 137,
    "cen1": 138,
    "cen2": 139,
    "cen3": 140,
    "cen4": 141,
    "cen5": 142,
    "ceng1": 143,
    "ceng2": 144,
    "ceng3": 145,
    "ceng4": 146,
    "ceng5": 147,
    "cha1": 148,
    "cha2": 149,
    "cha3": 150,
    "cha4": 151,
    "cha5": 152,
    "chai1": 153,
    "chai2": 154,
    "chai3": 155,
    "chai4": 156,
    "chai5": 157,
    "chan1": 158,
    "chan2": 159,
    "chan3": 160,
    "chan4": 161,
    "chan5": 162,
    "chang1": 163,
    "chang2": 164,
    "chang3": 165,
    "chang4": 166,
    "chang5": 167,
    "chao1": 168,
    "chao2": 169,
    "chao3": 170,
    "chao4": 171,
    "chao5": 172,
    "che1": 173,
    "che2": 174,
    "che3": 175,
    "che4": 176,
    "che5": 177,
    "chen1": 178,
    "chen2": 179,
    "chen3": 180,
    "chen4": 181,
    "chen5": 182,
    "cheng1": 183,
    "cheng2": 184,
    "cheng3": 185,
    "cheng4": 186,
    "cheng5": 187,
    "chi1": 188,
    "chi2": 189,
    "chi3": 190,
    "chi4": 191,
    "chi5": 192,
    "chong1": 193,
    "chong2": 194,
    "chong3": 195,
    "chong4": 196,
    "chong5": 197,
    "chou1": 198,
    "chou2": 199,
    "chou3": 200,
    "chou4": 201,
    "chou5": 202,
    "chu1": 203,
    "chu2": 204,
    "chu3": 205,
    "chu4": 206,
    "chu5": 207,
    "chua1": 208,
    "chua2": 209,
    "chua3": 210,
    "chua4": 211,
    "chua5": 212,
    "chuai1": 213,
    "chuai2": 214,
    "chuai3": 215,
    "chuai4": 216,
    "chuai5": 217,
    "chuan1": 218,
    "chuan2": 219,
    "chuan3": 220,
    "chuan4": 221,
    "chuan5": 222,
    "chuang1": 223,
    "chuang2": 224,
    "chuang3": 225,
    "chuang4": 226,
    "chuang5": 227,
    "chui1": 228,
    "chui2": 229,
    "chui3": 230,
    "chui4": 231,
    "chui5": 232,
    "chun1": 233,
    "chun2": 234,
    "chun3": 235,
    "chun4": 236,
    "chun5": 237,
    "chuo1": 238,
    "chuo2": 239,
    "chuo3": 240,
    "chuo4": 241,
    "chuo5": 242,
    "ci1": 243,
    "ci2": 244,
    "ci3": 245,
    "ci4": 246,
    "ci5": 247,
    "cong1": 248,
    "cong2": 249,
    "cong3": 250,
    "cong4": 251,
    "cong5": 252,
    "cou1": 253,
    "cou2": 254,
    "cou3": 255,
    "cou4": 256,
    "cou5": 257,
    "cu1": 258,
    "cu2": 259,
    "cu3": 260,
    "cu4": 261,
    "cu5": 262,
    "cuan1": 263,
    "cuan2": 264,
    "cuan3": 265,
    "cuan4": 266,
    "cuan5": 267,
    "cui1": 268,
    "cui2": 269,
    "cui3": 270,
    "cui4": 271,
    "cui5": 272,
    "cun1": 273,
    "cun2": 274,
    "cun3": 275,
    "cun4": 276,
    "cun5": 277,
    "cuo1": 278,
    "cuo2": 279,
    "cuo3": 280,
    "cuo4": 281,
    "cuo5": 282,
    "da1": 283,
    "da2": 284,
    "da3": 285,
    "da4": 286,
    "da5": 287,
    "dai1": 288,
    "dai2": 289,
    "dai3": 290,
    "dai4": 291,
    "dai5": 292,
    "dan1": 293,
    "dan2": 294,
    "dan3": 295,
    "dan4": 296,
    "dan5": 297,
    "dang1": 298,
    "dang2": 299,
    "dang3": 300,
    "dang4": 301,
    "dang5": 302,
    "dao1": 303,
    "dao2": 304,
    "dao3": 305,
    "dao4": 306,
    "dao5": 307,
    "de1": 308,
    "de2": 309,
    "de3": 310,
    "de4": 311,
    "de5": 312,
    "dei1": 313,
    "dei2": 314,
    "dei3": 315,
    "dei4": 316,
    "dei5": 317,
    "den1": 318,
    "den2": 319,
    "den3": 320,
    "den4": 321,
    "den5": 322,
    "deng1": 323,
    "deng2": 324,
    "deng3": 325,
    "deng4": 326,
    "deng5": 327,
    "di1": 328,
    "di2": 329,
    "di3": 330,
    "di4": 331,
    "di5": 332,
    "dian1": 333,
    "dian2": 334,
    "dian3": 335,
    "dian4": 336,
    "dian5": 337,
    "diao1": 338,
    "diao2": 339,
    "diao3": 340,
    "diao4": 341,
    "diao5": 342,
    "die1": 343,
    "die2": 344,
    "die3": 345,
    "die4": 346,
    "die5": 347,
    "ding1": 348,
    "ding2": 349,
    "ding3": 350,
    "ding4": 351,
    "ding5": 352,
    "diu1": 353,
    "diu2": 354,
    "diu3": 355,
    "diu4": 356,
    "diu5": 357,
    "dong1": 358,
    "dong2": 359,
    "dong3": 360,
    "dong4": 361,
    "dong5": 362,
    "dou1": 363,
    "dou2": 364,
    "dou3": 365,
    "dou4": 366,
    "dou5": 367,
    "du1": 368,
    "du2": 369,
    "du3": 370,
    "du4": 371,
    "du5": 372,
    "duan1": 373,
    "duan2": 374,
    "duan3": 375,
    "duan4": 376,
    "duan5": 377,
    "dui1": 378,
    "dui2": 379,
    "dui3": 380,
    "dui4": 381,
    "dui5": 382,
    "dun1": 383,
    "dun2": 384,
    "dun3": 385,
    "dun4": 386,
    "dun5": 387,
    "duo1": 388,
    "duo2": 389,
    "duo3": 390,
    "duo4": 391,
    "duo5": 392,
    "e1": 393,
    "e2": 394,
    "e3": 395,
    "e4": 396,
    "e5": 397,
    "ei1": 398,
    "ei2": 399,
    "ei3": 400,
    "ei4": 401,
    "ei5": 402,
    "en1": 403,
    "en2": 404,
    "en3": 405,
    "en4": 406,
    "en5": 407,
    "eng1": 408,
    "eng2": 409,
    "eng3": 410,
    "eng4": 411,
    "eng5": 412,
    "er1": 413,
    "er2": 414,
    "er3": 415,
    "er4": 416,
    "er5": 417,
    "fa1": 418,
    "fa2": 419,
    "fa3": 420,
    "fa4": 421,
    "fa5": 422,
    "fan1": 423,
    "fan2": 424,
    "fan3": 425,
    "fan4": 426,
    "fan5": 427,
    "fang1": 428,
    "fang2": 429,
    "fang3": 430,
    "fang4": 431,
    "fang5": 432,
    "fei1": 433,
    "fei2": 434,
    "fei3": 435,
    "fei4": 436,
    "fei5": 437,
    "fen1": 438,
    "fen2": 439,
    "fen3": 440,
    "fen4": 441,
    "fen5": 442,
    "feng1": 443,
    "feng2": 444,
    "feng3": 445,
    "feng4": 446,
    "feng5": 447,
    "fo1": 448,
    "fo2": 449,
    "fo3": 450,
    "fo4": 451,
    "fo5": 452,
    "fou1": 453,
    "fou2": 454,
    "fou3": 455,
    "fou4": 456,
    "fou5": 457,
    "fu1": 458,
    "fu2": 459,
    "fu3": 460,
    "fu4": 461,
    "fu5": 462,
    "ga1": 463,
    "ga2": 464,
    "ga3": 465,
    "ga4": 466,
    "ga5": 467,
    "gai1": 468,
    "gai2": 469,
    "gai3": 470,
    "gai4": 471,
    "gai5": 472,
    "gan1": 473,
    "gan2": 474,
    "gan3": 475,
    "gan4": 476,
    "gan5": 477,
    "gang1": 478,
    "gang2": 479,
    "gang3": 480,
    "gang4": 481,
    "gang5": 482,
    "gao1": 483,
    "gao2": 484,
    "gao3": 485,
    "gao4": 486,
    "gao5": 487,
    "ge1": 488,
    "ge2": 489,
    "ge3": 490,
    "ge4": 491,
    "ge5": 492,
    "gei1": 493,
    "gei2": 494,
    "gei3": 495,
    "gei4": 496,
    "gei5": 497,
    "gen1": 498,
    "gen2": 499,
    "gen3": 500,
    "gen4": 501,
    "gen5": 502,
    "geng1": 503,
    "geng2": 504,
    "geng3": 505,
    "geng4": 506,
    "geng5": 507,
    "gong1": 508,
    "gong2": 509,
    "gong3": 510,
    "gong4": 511,
    "gong5": 512,
    "gou1": 513,
    "gou2": 514,
    "gou3": 515,
    "gou4": 516,
    "gou5": 517,
    "gu1": 518,
    "gu2": 519,
    "gu3": 520,
    "gu4": 521,
    "gu5": 522,
    "gua1": 523,
    "gua2": 524,
    "gua3": 525,
    "gua4": 526,
    "gua5": 527,
    "guai1": 528,
    "guai2": 529,
    "guai3": 530,
    "guai4": 531,
    "guai5": 532,
    "guan1": 533,
    "guan2": 534,
    "guan3": 535,
    "guan4": 536,
    "guan5": 537,
    "guang1": 538,
    "guang2": 539,
    "guang3": 540,
    "guang4": 541,
    "guang5": 542,
    "gui1": 543,
    "gui2": 544,
    "gui3": 545,
    "gui4": 546,
    "gui5": 547,
    "gun1": 548,
    "gun2": 549,
    "gun3": 550,
    "gun4": 551,
    "gun5": 552,
    "guo1": 553,
    "guo2": 554,
    "guo3": 555,
    "guo4": 556,
    "guo5": 557,
    "ha1": 558,
    "ha2": 559,
    "ha3": 560,
    "ha4": 561,
    "ha5": 562,
    "hai1": 563,
    "hai2": 564,
    "hai3": 565,
    "hai4": 566,
    "hai5": 567,
    "han1": 568,
    "han2": 569,
    "han3": 570,
    "han4": 571,
    "han5": 572,
    "hang1": 573,
    "hang2": 574,
    "hang3": 575,
    "hang4": 576,
    "hang5": 577,
    "hao1": 578,
    "hao2": 579,
    "hao3": 580,
    "hao4": 581,
    "hao5": 582,
    "he1": 583,
    "he2": 584,
    "he3": 585,
    "he4": 586,
    "he5": 587,
    "hei1": 588,
    "hei2": 589,
    "hei3": 590,
    "hei4": 591,
    "hei5": 592,
    "hen1": 593,
    "hen2": 594,
    "hen3": 595,
    "hen4": 596,
    "hen5": 597,
    "heng1": 598,
    "heng2": 599,
    "heng3": 600,
    "heng4": 601,
    "heng5": 602,
    "hng1": 603,
    "hng2": 604,
    "hng3": 605,
    "hng4": 606,
    "hng5": 607,
    "hong1": 608,
    "hong2": 609,
    "hong3": 610,
    "hong4": 611,
    "hong5": 612,
    "hou1": 613,
    "hou2": 614,
    "hou3": 615,
    "hou4": 616,
    "hou5": 617,
    "hu1": 618,
    "hu2": 619,
    "hu3": 620,
    "hu4": 621,
    "hu5": 622,
    "hua1": 623,
    "hua2": 624,
    "hua3": 625,
    "hua4": 626,
    "hua5": 627,
    "huai1": 628,
    "huai2": 629,
    "huai3": 630,
    "huai4": 631,
    "huai5": 632,
    "huan1": 633,
    "huan2": 634,
    "huan3": 635,
    "huan4": 636,
    "huan5": 637,
    "huang1": 638,
    "huang2": 639,
    "huang3": 640,
    "huang4": 641,
    "huang5": 642,
    "hui1": 643,
    "hui2": 644,
    "hui3": 645,
    "hui4": 646,
    "hui5": 647,
    "hun1": 648,
    "hun2": 649,
    "hun3": 650,
    "hun4": 651,
    "hun5": 652,
    "huo1": 653,
    "huo2": 654,
    "huo3": 655,
    "huo4": 656,
    "huo5": 657,
    "ji1": 658,
    "ji2": 659,
    "ji3": 660,
    "ji4": 661,
    "ji5": 662,
    "jia1": 663,
    "jia2": 664,
    "jia3": 665,
    "jia4": 666,
    "jia5": 667,
    "jian1": 668,
    "jian2": 669,
    "jian3": 670,
    "jian4": 671,
    "jian5": 672,
    "jiang1": 673,
    "jiang2": 674,
    "jiang3": 675,
    "jiang4": 676,
    "jiang5": 677,
    "jiao1": 678,
    "jiao2": 679,
    "jiao3": 680,
    "jiao4": 681,
    "jiao5": 682,
    "jie1": 683,
    "jie2": 684,
    "jie3": 685,
    "jie4": 686,
    "jie5": 687,
    "jin1": 688,
    "jin2": 689,
    "jin3": 690,
    "jin4": 691,
    "jin5": 692,
    "jing1": 693,
    "jing2": 694,
    "jing3": 695,
    "jing4": 696,
    "jing5": 697,
    "jiong1": 698,
    "jiong2": 699,
    "jiong3": 700,
    "jiong4": 701,
    "jiong5": 702,
    "jiu1": 703,
    "jiu2": 704,
    "jiu3": 705,
    "jiu4": 706,
    "jiu5": 707,
    "ju1": 708,
    "ju2": 709,
    "ju3": 710,
    "ju4": 711,
    "ju5": 712,
    "juan1": 713,
    "juan2": 714,
    "juan3": 715,
    "juan4": 716,
    "juan5": 717,
    "jue1": 718,
    "jue2": 719,
    "jue3": 720,
    "jue4": 721,
    "jue5": 722,
    "jun1": 723,
    "jun2": 724,
    "jun3": 725,
    "jun4": 726,
    "jun5": 727,
    "ka1": 728,
    "ka2": 729,
    "ka3": 730,
    "ka4": 731,
    "ka5": 732,
    "kai1": 733,
    "kai2": 734,
    "kai3": 735,
    "kai4": 736,
    "kai5": 737,
    "kan1": 738,
    "kan2": 739,
    "kan3": 740,
    "kan4": 741,
    "kan5": 742,
    "kang1": 743,
    "kang2": 744,
    "kang3": 745,
    "kang4": 746,
    "kang5": 747,
    "kao1": 748,
    "kao2": 749,
    "kao3": 750,
    "kao4": 751,
    "kao5": 752,
    "ke1": 753,
    "ke2": 754,
    "ke3": 755,
    "ke4": 756,
    "ke5": 757,
    "kei1": 758,
    "kei2": 759,
    "kei3": 760,
    "kei4": 761,
    "kei5": 762,
    "ken1": 763,
    "ken2": 764,
    "ken3": 765,
    "ken4": 766,
    "ken5": 767,
    "keng1": 768,
    "keng2": 769,
    "keng3": 770,
    "keng4": 771,
    "keng5": 772,
    "kong1": 773,
    "kong2": 774,
    "kong3": 775,
    "kong4": 776,
    "kong5": 777,
    "kou1": 778,
    "kou2": 779,
    "kou3": 780,
    "kou4": 781,
    "kou5": 782,
    "ku1": 783,
    "ku2": 784,
    "ku3": 785,
    "ku4": 786,
    "ku5": 787,
    "kua1": 788,
    "kua2": 789,
    "kua3": 790,
    "kua4": 791,
    "kua5": 792,
    "kuai1": 793,
    "kuai2": 794,
    "kuai3": 795,
    "kuai4": 796,
    "kuai5": 797,
    "kuan1": 798,
    "kuan2": 799,
    "kuan3": 800,
    "kuan4": 801,
    "kuan5": 802,
    "kuang1": 803,
    "kuang2": 804,
    "kuang3": 805,
    "kuang4": 806,
    "kuang5": 807,
    "kui1": 808,
    "kui2": 809,
    "kui3": 810,
    "kui4": 811,
    "kui5": 812,
    "kun1": 813,
    "kun2": 814,
    "kun3": 815,
    "kun4": 816,
    "kun5": 817,
    "kuo1": 818,
    "kuo2": 819,
    "kuo3": 820,
    "kuo4": 821,
    "kuo5": 822,
    "la1": 823,
    "la2": 824,
    "la3": 825,
    "la4": 826,
    "la5": 827,
    "lai1": 828,
    "lai2": 829,
    "lai3": 830,
    "lai4": 831,
    "lai5": 832,
    "lan1": 833,
    "lan2": 834,
    "lan3": 835,
    "lan4": 836,
    "lan5": 837,
    "lang1": 838,
    "lang2": 839,
    "lang3": 840,
    "lang4": 841,
    "lang5": 842,
    "lao1": 843,
    "lao2": 844,
    "lao3": 845,
    "lao4": 846,
    "lao5": 847,
    "le1": 848,
    "le2": 849,
    "le3": 850,
    "le4": 851,
    "le5": 852,
    "lei1": 853,
    "lei2": 854,
    "lei3": 855,
    "lei4": 856,
    "lei5": 857,
    "leng1": 858,
    "leng2": 859,
    "leng3": 860,
    "leng4": 861,
    "leng5": 862,
    "li1": 863,
    "li2": 864,
    "li3": 865,
    "li4": 866,
    "li5": 867,
    "lia1": 868,
    "lia2": 869,
    "lia3": 870,
    "lia4": 871,
    "lia5": 872,
    "lian1": 873,
    "lian2": 874,
    "lian3": 875,
    "lian4": 876,
    "lian5": 877,
    "liang1": 878,
    "liang2": 879,
    "liang3": 880,
    "liang4": 881,
    "liang5": 882,
    "liao1": 883,
    "liao2": 884,
    "liao3": 885,
    "liao4": 886,
    "liao5": 887,
    "lie1": 888,
    "lie2": 889,
    "lie3": 890,
    "lie4": 891,
    "lie5": 892,
    "lin1": 893,
    "lin2": 894,
    "lin3": 895,
    "lin4": 896,
    "lin5": 897,
    "ling1": 898,
    "ling2": 899,
    "ling3": 900,
    "ling4": 901,
    "ling5": 902,
    "liu1": 903,
    "liu2": 904,
    "liu3": 905,
    "liu4": 906,
    "liu5": 907,
    "long1": 908,
    "long2": 909,
    "long3": 910,
    "long4": 911,
    "long5": 912,
    "lou1": 913,
    "lou2": 914,
    "lou3": 915,
    "lou4": 916,
    "lou5": 917,
    "lu1": 918,
    "lu2": 919,
    "lu3": 920,
    "lu4": 921,
    "lu5": 922,
    "luan1": 923,
    "luan2": 924,
    "luan3": 925,
    "luan4": 926,
    "luan5": 927,
    "lue1": 928,
    "lue2": 929,
    "lue3": 930,
    "lue4": 931,
    "lue5": 932,
    "lun1": 933,
    "lun2": 934,
    "lun3": 935,
    "lun4": 936,
    "lun5": 937,
    "luo1": 938,
    "luo2": 939,
    "luo3": 940,
    "luo4": 941,
    "luo5": 942,
    "lv1": 943,
    "lv2": 944,
    "lv3": 945,
    "lv4": 946,
    "lv5": 947,
    "lve1": 948,
    "lve2": 949,
    "lve3": 950,
    "lve4": 951,
    "lve5": 952,
    "ma1": 953,
    "ma2": 954,
    "ma3": 955,
    "ma4": 956,
    "ma5": 957,
    "mai1": 958,
    "mai2": 959,
    "mai3": 960,
    "mai4": 961,
    "mai5": 962,
    "man1": 963,
    "man2": 964,
    "man3": 965,
    "man4": 966,
    "man5": 967,
    "mang1": 968,
    "mang2": 969,
    "mang3": 970,
    "mang4": 971,
    "mang5": 972,
    "mao1": 973,
    "mao2": 974,
    "mao3": 975,
    "mao4": 976,
    "mao5": 977,
    "me1": 978,
    "me2": 979,
    "me3": 980,
    "me4": 981,
    "me5": 982,
    "mei1": 983,
    "mei2": 984,
    "mei3": 985,
    "mei4": 986,
    "mei5": 987,
    "men1": 988,
    "men2": 989,
    "men3": 990,
    "men4": 991,
    "men5": 992,
    "meng1": 993,
    "meng2": 994,
    "meng3": 995,
    "meng4": 996,
    "meng5": 997,
    "mi1": 998,
    "mi2": 999,
    "mi3": 1000,
    "mi4": 1001,
    "mi5": 1002,
    "mian1": 1003,
    "mian2": 1004,
    "mian3": 1005,
    "mian4": 1006,
    "mian5": 1007,
    "miao1": 1008,
    "miao2": 1009,
    "miao3": 1010,
    "miao4": 1011,
    "miao5": 1012,
    "mie1": 1013,
    "mie2": 1014,
    "mie3": 1015,
    "mie4": 1016,
    "mie5": 1017,
    "min1": 1018,
    "min2": 1019,
    "min3": 1020,
    "min4": 1021,
    "min5": 1022,
    "ming1": 1023,
    "ming2": 1024,
    "ming3": 1025,
    "ming4": 1026,
    "ming5": 1027,
    "miu1": 1028,
    "miu2": 1029,
    "miu3": 1030,
    "miu4": 1031,
    "miu5": 1032,
    "mo1": 1033,
    "mo2": 1034,
    "mo3": 1035,
    "mo4": 1036,
    "mo5": 1037,
    "mou1": 1038,
    "mou2": 1039,
    "mou3": 1040,
    "mou4": 1041,
    "mou5": 1042,
    "mu1": 1043,
    "mu2": 1044,
    "mu3": 1045,
    "mu4": 1046,
    "mu5": 1047,
    "na1": 1048,
    "na2": 1049,
    "na3": 1050,
    "na4": 1051,
    "na5": 1052,
    "nai1": 1053,
    "nai2": 1054,
    "nai3": 1055,
    "nai4": 1056,
    "nai5": 1057,
    "nan1": 1058,
    "nan2": 1059,
    "nan3": 1060,
    "nan4": 1061,
    "nan5": 1062,
    "nang1": 1063,
    "nang2": 1064,
    "nang3": 1065,
    "nang4": 1066,
    "nang5": 1067,
    "nao1": 1068,
    "nao2": 1069,
    "nao3": 1070,
    "nao4": 1071,
    "nao5": 1072,
    "ne1": 1073,
    "ne2": 1074,
    "ne3": 1075,
    "ne4": 1076,
    "ne5": 1077,
    "nei1": 1078,
    "nei2": 1079,
    "nei3": 1080,
    "nei4": 1081,
    "nei5": 1082,
    "nen1": 1083,
    "nen2": 1084,
    "nen3": 1085,
    "nen4": 1086,
    "nen5": 1087,
    "neng1": 1088,
    "neng2": 1089,
    "neng3": 1090,
    "neng4": 1091,
    "neng5": 1092,
    "ng1": 1093,
    "ng2": 1094,
    "ng3": 1095,
    "ng4": 1096,
    "ng5": 1097,
    "ni1": 1098,
    "ni2": 1099,
    "ni3": 1100,
    "ni4": 1101,
    "ni5": 1102,
    "nian1": 1103,
    "nian2": 1104,
    "nian3": 1105,
    "nian4": 1106,
    "nian5": 1107,
    "niang1": 1108,
    "niang2": 1109,
    "niang3": 1110,
    "niang4": 1111,
    "niang5": 1112,
    "niao1": 1113,
    "niao2": 1114,
    "niao3": 1115,
    "niao4": 1116,
    "niao5": 1117,
    "nie1": 1118,
    "nie2": 1119,
    "nie3": 1120,
    "nie4": 1121,
    "nie5": 1122,
    "nin1": 1123,
    "nin2": 1124,
    "nin3": 1125,
    "nin4": 1126,
    "nin5": 1127,
    "ning1": 1128,
    "ning2": 1129,
    "ning3": 1130,
    "ning4": 1131,
    "ning5": 1132,
    "niu1": 1133,
    "niu2": 1134,
    "niu3": 1135,
    "niu4": 1136,
    "niu5": 1137,
    "nong1": 1138,
    "nong2": 1139,
    "nong3": 1140,
    "nong4": 1141,
    "nong5": 1142,
    "nou1": 1143,
    "nou2": 1144,
    "nou3": 1145,
    "nou4": 1146,
    "nou5": 1147,
    "nu1": 1148,
    "nu2": 1149,
    "nu3": 1150,
    "nu4": 1151,
    "nu5": 1152,
    "nuan1": 1153,
    "nuan2": 1154,
    "nuan3": 1155,
    "nuan4": 1156,
    "nuan5": 1157,
    "nue1": 1158,
    "nue2": 1159,
    "nue3": 1160,
    "nue4": 1161,
    "nue5": 1162,
    "nuo1": 1163,
    "nuo2": 1164,
    "nuo3": 1165,
    "nuo4": 1166,
    "nuo5": 1167,
    "nv1": 1168,
    "nv2": 1169,
    "nv3": 1170,
    "nv4": 1171,
    "nv5": 1172,
    "nve1": 1173,
    "nve2": 1174,
    "nve3": 1175,
    "nve4": 1176,
    "nve5": 1177,
    "o1": 1178,
    "o2": 1179,
    "o3": 1180,
    "o4": 1181,
    "o5": 1182,
    "ou1": 1183,
    "ou2": 1184,
    "ou3": 1185,
    "ou4": 1186,
    "ou5": 1187,
    "pa1": 1188,
    "pa2": 1189,
    "pa3": 1190,
    "pa4": 1191,
    "pa5": 1192,
    "pai1": 1193,
    "pai2": 1194,
    "pai3": 1195,
    "pai4": 1196,
    "pai5": 1197,
    "pan1": 1198,
    "pan2": 1199,
    "pan3": 1200,
    "pan4": 1201,
    "pan5": 1202,
    "pang1": 1203,
    "pang2": 1204,
    "pang3": 1205,
    "pang4": 1206,
    "pang5": 1207,
    "pao1": 1208,
    "pao2": 1209,
    "pao3": 1210,
    "pao4": 1211,
    "pao5": 1212,
    "pei1": 1213,
    "pei2": 1214,
    "pei3": 1215,
    "pei4": 1216,
    "pei5": 1217,
    "pen1": 1218,
    "pen2": 1219,
    "pen3": 1220,
    "pen4": 1221,
    "pen5": 1222,
    "peng1": 1223,
    "peng2": 1224,
    "peng3": 1225,
    "peng4": 1226,
    "peng5": 1227,
    "pi1": 1228,
    "pi2": 1229,
    "pi3": 1230,
    "pi4": 1231,
    "pi5": 1232,
    "pian1": 1233,
    "pian2": 1234,
    "pian3": 1235,
    "pian4": 1236,
    "pian5": 1237,
    "piao1": 1238,
    "piao2": 1239,
    "piao3": 1240,
    "piao4": 1241,
    "piao5": 1242,
    "pie1": 1243,
    "pie2": 1244,
    "pie3": 1245,
    "pie4": 1246,
    "pie5": 1247,
    "pin1": 1248,
    "pin2": 1249,
    "pin3": 1250,
    "pin4": 1251,
    "pin5": 1252,
    "ping1": 1253,
    "ping2": 1254,
    "ping3": 1255,
    "ping4": 1256,
    "ping5": 1257,
    "po1": 1258,
    "po2": 1259,
    "po3": 1260,
    "po4": 1261,
    "po5": 1262,
    "pou1": 1263,
    "pou2": 1264,
    "pou3": 1265,
    "pou4": 1266,
    "pou5": 1267,
    "pu1": 1268,
    "pu2": 1269,
    "pu3": 1270,
    "pu4": 1271,
    "pu5": 1272,
    "qi1": 1273,
    "qi2": 1274,
    "qi3": 1275,
    "qi4": 1276,
    "qi5": 1277,
    "qia1": 1278,
    "qia2": 1279,
    "qia3": 1280,
    "qia4": 1281,
    "qia5": 1282,
    "qian1": 1283,
    "qian2": 1284,
    "qian3": 1285,
    "qian4": 1286,
    "qian5": 1287,
    "qiang1": 1288,
    "qiang2": 1289,
    "qiang3": 1290,
    "qiang4": 1291,
    "qiang5": 1292,
    "qiao1": 1293,
    "qiao2": 1294,
    "qiao3": 1295,
    "qiao4": 1296,
    "qiao5": 1297,
    "qie1": 1298,
    "qie2": 1299,
    "qie3": 1300,
    "qie4": 1301,
    "qie5": 1302,
    "qin1": 1303,
    "qin2": 1304,
    "qin3": 1305,
    "qin4": 1306,
    "qin5": 1307,
    "qing1": 1308,
    "qing2": 1309,
    "qing3": 1310,
    "qing4": 1311,
    "qing5": 1312,
    "qiong1": 1313,
    "qiong2": 1314,
    "qiong3": 1315,
    "qiong4": 1316,
    "qiong5": 1317,
    "qiu1": 1318,
    "qiu2": 1319,
    "qiu3": 1320,
    "qiu4": 1321,
    "qiu5": 1322,
    "qu1": 1323,
    "qu2": 1324,
    "qu3": 1325,
    "qu4": 1326,
    "qu5": 1327,
    "quan1": 1328,
    "quan2": 1329,
    "quan3": 1330,
    "quan4": 1331,
    "quan5": 1332,
    "que1": 1333,
    "que2": 1334,
    "que3": 1335,
    "que4": 1336,
    "que5": 1337,
    "qun1": 1338,
    "qun2": 1339,
    "qun3": 1340,
    "qun4": 1341,
    "qun5": 1342,
    "ran1": 1343,
    "ran2": 1344,
    "ran3": 1345,
    "ran4": 1346,
    "ran5": 1347,
    "rang1": 1348,
    "rang2": 1349,
    "rang3": 1350,
    "rang4": 1351,
    "rang5": 1352,
    "rao1": 1353,
    "rao2": 1354,
    "rao3": 1355,
    "rao4": 1356,
    "rao5": 1357,
    "re1": 1358,
    "re2": 1359,
    "re3": 1360,
    "re4": 1361,
    "re5": 1362,
    "ren1": 1363,
    "ren2": 1364,
    "ren3": 1365,
    "ren4": 1366,
    "ren5": 1367,
    "reng1": 1368,
    "reng2": 1369,
    "reng3": 1370,
    "reng4": 1371,
    "reng5": 1372,
    "ri1": 1373,
    "ri2": 1374,
    "ri3": 1375,
    "ri4": 1376,
    "ri5": 1377,
    "rong1": 1378,
    "rong2": 1379,
    "rong3": 1380,
    "rong4": 1381,
    "rong5": 1382,
    "rou1": 1383,
    "rou2": 1384,
    "rou3": 1385,
    "rou4": 1386,
    "rou5": 1387,
    "ru1": 1388,
    "ru2": 1389,
    "ru3": 1390,
    "ru4": 1391,
    "ru5": 1392,
    "ruan1": 1393,
    "ruan2": 1394,
    "ruan3": 1395,
    "ruan4": 1396,
    "ruan5": 1397,
    "rui1": 1398,
    "rui2": 1399,
    "rui3": 1400,
    "rui4": 1401,
    "rui5": 1402,
    "run1": 1403,
    "run2": 1404,
    "run3": 1405,
    "run4": 1406,
    "run5": 1407,
    "ruo1": 1408,
    "ruo2": 1409,
    "ruo3": 1410,
    "ruo4": 1411,
    "ruo5": 1412,
    "sa1": 1413,
    "sa2": 1414,
    "sa3": 1415,
    "sa4": 1416,
    "sa5": 1417,
    "sai1": 1418,
    "sai2": 1419,
    "sai3": 1420,
    "sai4": 1421,
    "sai5": 1422,
    "san1": 1423,
    "san2": 1424,
    "san3": 1425,
    "san4": 1426,
    "san5": 1427,
    "sang1": 1428,
    "sang2": 1429,
    "sang3": 1430,
    "sang4": 1431,
    "sang5": 1432,
    "sao1": 1433,
    "sao2": 1434,
    "sao3": 1435,
    "sao4": 1436,
    "sao5": 1437,
    "se1": 1438,
    "se2": 1439,
    "se3": 1440,
    "se4": 1441,
    "se5": 1442,
    "sen1": 1443,
    "sen2": 1444,
    "sen3": 1445,
    "sen4": 1446,
    "sen5": 1447,
    "seng1": 1448,
    "seng2": 1449,
    "seng3": 1450,
    "seng4": 1451,
    "seng5": 1452,
    "sha1": 1453,
    "sha2": 1454,
    "sha3": 1455,
    "sha4": 1456,
    "sha5": 1457,
    "shai1": 1458,
    "shai2": 1459,
    "shai3": 1460,
    "shai4": 1461,
    "shai5": 1462,
    "shan1": 1463,
    "shan2": 1464,
    "shan3": 1465,
    "shan4": 1466,
    "shan5": 1467,
    "shang1": 1468,
    "shang2": 1469,
    "shang3": 1470,
    "shang4": 1471,
    "shang5": 1472,
    "shao1": 1473,
    "shao2": 1474,
    "shao3": 1475,
    "shao4": 1476,
    "shao5": 1477,
    "she1": 1478,
    "she2": 1479,
    "she3": 1480,
    "she4": 1481,
    "she5": 1482,
    "shei1": 1483,
    "shei2": 1484,
    "shei3": 1485,
    "shei4": 1486,
    "shei5": 1487,
    "shen1": 1488,
    "shen2": 1489,
    "shen3": 1490,
    "shen4": 1491,
    "shen5": 1492,
    "sheng1": 1493,
    "sheng2": 1494,
    "sheng3": 1495,
    "sheng4": 1496,
    "sheng5": 1497,
    "shi1": 1498,
    "shi2": 1499,
    "shi3": 1500,
    "shi4": 1501,
    "shi5": 1502,
    "shou1": 1503,
    "shou2": 1504,
    "shou3": 1505,
    "shou4": 1506,
    "shou5": 1507,
    "shu1": 1508,
    "shu2": 1509,
    "shu3": 1510,
    "shu4": 1511,
    "shu5": 1512,
    "shua1": 1513,
    "shua2": 1514,
    "shua3": 1515,
    "shua4": 1516,
    "shua5": 1517,
    "shuai1": 1518,
    "shuai2": 1519,
    "shuai3": 1520,
    "shuai4": 1521,
    "shuai5": 1522,
    "shuan1": 1523,
    "shuan2": 1524,
    "shuan3": 1525,
    "shuan4": 1526,
    "shuan5": 1527,
    "shuang1": 1528,
    "shuang2": 1529,
    "shuang3": 1530,
    "shuang4": 1531,
    "shuang5": 1532,
    "shui1": 1533,
    "shui2": 1534,
    "shui3": 1535,
    "shui4": 1536,
    "shui5": 1537,
    "shun1": 1538,
    "shun2": 1539,
    "shun3": 1540,
    "shun4": 1541,
    "shun5": 1542,
    "shuo1": 1543,
    "shuo2": 1544,
    "shuo3": 1545,
    "shuo4": 1546,
    "shuo5": 1547,
    "si1": 1548,
    "si2": 1549,
    "si3": 1550,
    "si4": 1551,
    "si5": 1552,
    "song1": 1553,
    "song2": 1554,
    "song3": 1555,
    "song4": 1556,
    "song5": 1557,
    "sou1": 1558,
    "sou2": 1559,
    "sou3": 1560,
    "sou4": 1561,
    "sou5": 1562,
    "su1": 1563,
    "su2": 1564,
    "su3": 1565,
    "su4": 1566,
    "su5": 1567,
    "suan1": 1568,
    "suan2": 1569,
    "suan3": 1570,
    "suan4": 1571,
    "suan5": 1572,
    "sui1": 1573,
    "sui2": 1574,
    "sui3": 1575,
    "sui4": 1576,
    "sui5": 1577,
    "sun1": 1578,
    "sun2": 1579,
    "sun3": 1580,
    "sun4": 1581,
    "sun5": 1582,
    "suo1": 1583,
    "suo2": 1584,
    "suo3": 1585,
    "suo4": 1586,
    "suo5": 1587,
    "ta1": 1588,
    "ta2": 1589,
    "ta3": 1590,
    "ta4": 1591,
    "ta5": 1592,
    "tai1": 1593,
    "tai2": 1594,
    "tai3": 1595,
    "tai4": 1596,
    "tai5": 1597,
    "tan1": 1598,
    "tan2": 1599,
    "tan3": 1600,
    "tan4": 1601,
    "tan5": 1602,
    "tang1": 1603,
    "tang2": 1604,
    "tang3": 1605,
    "tang4": 1606,
    "tang5": 1607,
    "tao1": 1608,
    "tao2": 1609,
    "tao3": 1610,
    "tao4": 1611,
    "tao5": 1612,
    "te1": 1613,
    "te2": 1614,
    "te3": 1615,
    "te4": 1616,
    "te5": 1617,
    "teng1": 1618,
    "teng2": 1619,
    "teng3": 1620,
    "teng4": 1621,
    "teng5": 1622,
    "ti1": 1623,
    "ti2": 1624,
    "ti3": 1625,
    "ti4": 1626,
    "ti5": 1627,
    "tian1": 1628,
    "tian2": 1629,
    "tian3": 1630,
    "tian4": 1631,
    "tian5": 1632,
    "tiao1": 1633,
    "tiao2": 1634,
    "tiao3": 1635,
    "tiao4": 1636,
    "tiao5": 1637,
    "tie1": 1638,
    "tie2": 1639,
    "tie3": 1640,
    "tie4": 1641,
    "tie5": 1642,
    "ting1": 1643,
    "ting2": 1644,
    "ting3": 1645,
    "ting4": 1646,
    "ting5": 1647,
    "tong1": 1648,
    "tong2": 1649,
    "tong3": 1650,
    "tong4": 1651,
    "tong5": 1652,
    "tou1": 1653,
    "tou2": 1654,
    "tou3": 1655,
    "tou4": 1656,
    "tou5": 1657,
    "tu1": 1658,
    "tu2": 1659,
    "tu3": 1660,
    "tu4": 1661,
    "tu5": 1662,
    "tuan1": 1663,
    "tuan2": 1664,
    "tuan3": 1665,
    "tuan4": 1666,
    "tuan5": 1667,
    "tui1": 1668,
    "tui2": 1669,
    "tui3": 1670,
    "tui4": 1671,
    "tui5": 1672,
    "tun1": 1673,
    "tun2": 1674,
    "tun3": 1675,
    "tun4": 1676,
    "tun5": 1677,
    "tuo1": 1678,
    "tuo2": 1679,
    "tuo3": 1680,
    "tuo4": 1681,
    "tuo5": 1682,
    "wa1": 1683,
    "wa2": 1684,
    "wa3": 1685,
    "wa4": 1686,
    "wa5": 1687,
    "wai1": 1688,
    "wai2": 1689,
    "wai3": 1690,
    "wai4": 1691,
    "wai5": 1692,
    "wan1": 1693,
    "wan2": 1694,
    "wan3": 1695,
    "wan4": 1696,
    "wan5": 1697,
    "wang1": 1698,
    "wang2": 1699,
    "wang3": 1700,
    "wang4": 1701,
    "wang5": 1702,
    "wei1": 1703,
    "wei2": 1704,
    "wei3": 1705,
    "wei4": 1706,
    "wei5": 1707,
    "wen1": 1708,
    "wen2": 1709,
    "wen3": 1710,
    "wen4": 1711,
    "wen5": 1712,
    "weng1": 1713,
    "weng2": 1714,
    "weng3": 1715,
    "weng4": 1716,
    "weng5": 1717,
    "wo1": 1718,
    "wo2": 1719,
    "wo3": 1720,
    "wo4": 1721,
    "wo5": 1722,
    "wu1": 1723,
    "wu2": 1724,
    "wu3": 1725,
    "wu4": 1726,
    "wu5": 1727,
    "xi1": 1728,
    "xi2": 1729,
    "xi3": 1730,
    "xi4": 1731,
    "xi5": 1732,
    "xia1": 1733,
    "xia2": 1734,
    "xia3": 1735,
    "xia4": 1736,
    "xia5": 1737,
    "xian1": 1738,
    "xian2": 1739,
    "xian3": 1740,
    "xian4": 1741,
    "xian5": 1742,
    "xiang1": 1743,
    "xiang2": 1744,
    "xiang3": 1745,
    "xiang4": 1746,
    "xiang5": 1747,
    "xiao1": 1748,
    "xiao2": 1749,
    "xiao3": 1750,
    "xiao4": 1751,
    "xiao5": 1752,
    "xie1": 1753,
    "xie2": 1754,
    "xie3": 1755,
    "xie4": 1756,
    "xie5": 1757,
    "xin1": 1758,
    "xin2": 1759,
    "xin3": 1760,
    "xin4": 1761,
    "xin5": 1762,
    "xing1": 1763,
    "xing2": 1764,
    "xing3": 1765,
    "xing4": 1766,
    "xing5": 1767,
    "xiong1": 1768,
    "xiong2": 1769,
    "xiong3": 1770,
    "xiong4": 1771,
    "xiong5": 1772,
    "xiu1": 1773,
    "xiu2": 1774,
    "xiu3": 1775,
    "xiu4": 1776,
    "xiu5": 1777,
    "xu1": 1778,
    "xu2": 1779,
    "xu3": 1780,
    "xu4": 1781,
    "xu5": 1782,
    "xuan1": 1783,
    "xuan2": 1784,
    "xuan3": 1785,
    "xuan4": 1786,
    "xuan5": 1787,
    "xue1": 1788,
    "xue2": 1789,
    "xue3": 1790,
    "xue4": 1791,
    "xue5": 1792,
    "xun1": 1793,
    "xun2": 1794,
    "xun3": 1795,
    "xun4": 1796,
    "xun5": 1797,
    "ya1": 1798,
    "ya2": 1799,
    "ya3": 1800,
    "ya4": 1801,
    "ya5": 1802,
    "yan1": 1803,
    "yan2": 1804,
    "yan3": 1805,
    "yan4": 1806,
    "yan5": 1807,
    "yang1": 1808,
    "yang2": 1809,
    "yang3": 1810,
    "yang4": 1811,
    "yang5": 1812,
    "yao1": 1813,
    "yao2": 1814,
    "yao3": 1815,
    "yao4": 1816,
    "yao5": 1817,
    "ye1": 1818,
    "ye2": 1819,
    "ye3": 1820,
    "ye4": 1821,
    "ye5": 1822,
    "yi1": 1823,
    "yi2": 1824,
    "yi3": 1825,
    "yi4": 1826,
    "yi5": 1827,
    "yin1": 1828,
    "yin2": 1829,
    "yin3": 1830,
    "yin4": 1831,
    "yin5": 1832,
    "ying1": 1833,
    "ying2": 1834,
    "ying3": 1835,
    "ying4": 1836,
    "ying5": 1837,
    "yo1": 1838,
    "yo2": 1839,
    "yo3": 1840,
    "yo4": 1841,
    "yo5": 1842,
    "yong1": 1843,
    "yong2": 1844,
    "yong3": 1845,
    "yong4": 1846,
    "yong5": 1847,
    "you1": 1848,
    "you2": 1849,
    "you3": 1850,
    "you4": 1851,
    "you5": 1852,
    "yu1": 1853,
    "yu2": 1854,
    "yu3": 1855,
    "yu4": 1856,
    "yu5": 1857,
    "yuan1": 1858,
    "yuan2": 1859,
    "yuan3": 1860,
    "yuan4": 1861,
    "yuan5": 1862,
    "yue1": 1863,
    "yue2": 1864,
    "yue3": 1865,
    "yue4": 1866,
    "yue5": 1867,
    "yun1": 1868,
    "yun2": 1869,
    "yun3": 1870,
    "yun4": 1871,
    "yun5": 1872,
    "za1": 1873,
    "za2": 1874,
    "za3": 1875,
    "za4": 1876,
    "za5": 1877,
    "zai1": 1878,
    "zai2": 1879,
    "zai3": 1880,
    "zai4": 1881,
    "zai5": 1882,
    "zan1": 1883,
    "zan2": 1884,
    "zan3": 1885,
    "zan4": 1886,
    "zan5": 1887,
    "zang1": 1888,
    "zang2": 1889,
    "zang3": 1890,
    "zang4": 1891,
    "zang5": 1892,
    "zao1": 1893,
    "zao2": 1894,
    "zao3": 1895,
    "zao4": 1896,
    "zao5": 1897,
    "ze1": 1898,
    "ze2": 1899,
    "ze3": 1900,
    "ze4": 1901,
    "ze5": 1902,
    "zei1": 1903,
    "zei2": 1904,
    "zei3": 1905,
    "zei4": 1906,
    "zei5": 1907,
    "zen1": 1908,
    "zen2": 1909,
    "zen3": 1910,
    "zen4": 1911,
    "zen5": 1912,
    "zeng1": 1913,
    "zeng2": 1914,
    "zeng3": 1915,
    "zeng4": 1916,
    "zeng5": 1917,
    "zha1": 1918,
    "zha2": 1919,
    "zha3": 1920,
    "zha4": 1921,
    "zha5": 1922,
    "zhai1": 1923,
    "zhai2": 1924,
    "zhai3": 1925,
    "zhai4": 1926,
    "zhai5": 1927,
    "zhan1": 1928,
    "zhan2": 1929,
    "zhan3": 1930,
    "zhan4": 1931,
    "zhan5": 1932,
    "zhang1": 1933,
    "zhang2": 1934,
    "zhang3": 1935,
    "zhang4": 1936,
    "zhang5": 1937,
    "zhao1": 1938,
    "zhao2": 1939,
    "zhao3": 1940,
    "zhao4": 1941,
    "zhao5": 1942,
    "zhe1": 1943,
    "zhe2": 1944,
    "zhe3": 1945,
    "zhe4": 1946,
    "zhe5": 1947,
    "zhei1": 1948,
    "zhei2": 1949,
    "zhei3": 1950,
    "zhei4": 1951,
    "zhei5": 1952,
    "zhen1": 1953,
    "zhen2": 1954,
    "zhen3": 1955,
    "zhen4": 1956,
    "zhen5": 1957,
    "zheng1": 1958,
    "zheng2": 1959,
    "zheng3": 1960,
    "zheng4": 1961,
    "zheng5": 1962,
    "zhi1": 1963,
    "zhi2": 1964,
    "zhi3": 1965,
    "zhi4": 1966,
    "zhi5": 1967,
    "zhong1": 1968,
    "zhong2": 1969,
    "zhong3": 1970,
    "zhong4": 1971,
    "zhong5": 1972,
    "zhou1": 1973,
    "zhou2": 1974,
    "zhou3": 1975,
    "zhou4": 1976,
    "zhou5": 1977,
    "zhu1": 1978,
    "zhu2": 1979,
    "zhu3": 1980,
    "zhu4": 1981,
    "zhu5": 1982,
    "zhua1": 1983,
    "zhua2": 1984,
    "zhua3": 1985,
    "zhua4": 1986,
    "zhua5": 1987,
    "zhuai1": 1988,
    "zhuai2": 1989,
    "zhuai3": 1990,
    "zhuai4": 1991,
    "zhuai5": 1992,
    "zhuan1": 1993,
    "zhuan2": 1994,
    "zhuan3": 1995,
    "zhuan4": 1996,
    "zhuan5": 1997,
    "zhuang1": 1998,
    "zhuang2": 1999,
    "zhuang3": 2000,
    "zhuang4": 2001,
    "zhuang5": 2002,
    "zhui1": 2003,
    "zhui2": 2004,
    "zhui3": 2005,
    "zhui4": 2006,
    "zhui5": 2007,
    "zhun1": 2008,
    "zhun2": 2009,
    "zhun3": 2010,
    "zhun4": 2011,
    "zhun5": 2012,
    "zhuo1": 2013,
    "zhuo2": 2014,
    "zhuo3": 2015,
    "zhuo4": 2016,
    "zhuo5": 2017,
    "zi1": 2018,
    "zi2": 2019,
    "zi3": 2020,
    "zi4": 2021,
    "zi5": 2022,
    "zong1": 2023,
    "zong2": 2024,
    "zong3": 2025,
    "zong4": 2026,
    "zong5": 2027,
    "zou1": 2028,
    "zou2": 2029,
    "zou3": 2030,
    "zou4": 2031,
    "zou5": 2032,
    "zu1": 2033,
    "zu2": 2034,
    "zu3": 2035,
    "zu4": 2036,
    "zu5": 2037,
    "zuan1": 2038,
    "zuan2": 2039,
    "zuan3": 2040,
    "zuan4": 2041,
    "zuan5": 2042,
    "zui1": 2043,
    "zui2": 2044,
    "zui3": 2045,
    "zui4": 2046,
    "zui5": 2047,
    "zun1": 2048,
    "zun2": 2049,
    "zun3": 2050,
    "zun4": 2051,
    "zun5": 2052,
    "zuo1": 2053,
    "zuo2": 2054,
    "zuo3": 2055,
    "zuo4": 2056,
    "zuo5": 2057
}